package OopWeek2;


public class Task1Objects {

    /*
Стол
Состояния:
- предметы в верхнем ящике
- предметы в среднем ящике
- предметы в нижнем ящике
- предметы в на поверхности стола
Действия
- переложить предметы
- поставить кофе на стол
- протереть стол
- полить цветок на столе

Компьютерная мышь
Состояния
- кнопка нажата 1 раз
- кнопка нажата 2 раза
- кнопка начата вместе с кнопкой клавиатуры
Действия
- Нажатие кнопки
- Двойное нажатие кнопки
- навести поинтер на точку

Будильник
Состояния:
- текущее время
- время подъема
- какую мелодию играть
Действия:
- Установить время подъема
- Играть сигнал подъема
- Выключить сигнал
- Установить текущее время

    */
}
